---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.GetBendData
zh: 钢筋、配筋
source: html/e20b8d30-f5b8-bf5e-4df5-dbb7498e2ccc.htm
---
# Autodesk.Revit.DB.Structure.Rebar.GetBendData Method

**中文**: 钢筋、配筋

Gets the RebarBendData, containing bar and hook information, of the instance.

## Syntax (C#)
```csharp
public RebarBendData GetBendData()
```

## Remarks
Internally, the bend data is used by many RebarShape methods to generate shape geometry.